In [1]:
x = int (input("Enter the 1st number"))
y = int (input("Enter the 2nd number"))
z = x+y
print("The sum of two numbers is: ",z)

Enter the 1st number5
Enter the 2nd number10
The sum of two numbers is:  15

In [2]:
a = input("Enter your school name")

Enter your school nameAECS

In [3]:
type(a)

str

In [4]:
lambda argument : expressions

In [5]:
x = lambda a : a*a

In [6]:
x(4)

16

In [7]:
# Control flow
# if condition : expression

In [10]:
name = input("Enter your name")
if name == "Saurabh":
    print("Good morning",name)

Enter your nameSaurabh
Good morning Saurabh

In [12]:
name = input("enter your name")
if name == "Saurabh":
    print("How are you",name)
else:
    print("Good Morning sir")

enter your namesaurabh
Good Morning sir

In [13]:
x = "Saurabh Somkuwar"
for i in x:
    print(x)

Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar
Saurabh Somkuwar

In [14]:
for i in range(0,10):
    print(i)

0
1
2
3
4
5
6
7
8
9

In [15]:
#Print odd numbers from 0 to 10

In [17]:
for i in range(0,11):
    if (i%2 != 0):
        print(i)

1
3
5
7
9

In [18]:
#Print numbers in reverse

In [24]:
for i in range(10,0,-1):
    print(i)

10
9
8
7
6
5
4
3
2
1

In [25]:
fruits = ['Apple','Orange','Grapes']

In [26]:
for i in fruits:
    print(i)

Apple
Orange
Grapes

In [28]:
#while loop
While condition:
    body

SyntaxError: invalid syntax (<ipython-input-28-76789dce3ef5>, line 2)

In [29]:
i = 6
while (i>0):
    print(i)
    i= i -1

6
5
4
3
2
1

In [30]:
for i in range(3): #i=3
    for j in range(3): #j= 0,1,2
        print(i,j)

0 0
0 1
0 2
1 0
1 1
1 2
2 0
2 1
2 2

In [32]:
rows = int(input("Enter number of rows"))
for i in range(1,rows+1):
    for j in range(1,i+1):
        print("*",end=" ")
    print()

Enter number of rows5
*
* *
* * *
* * * *
* * * * *

In [33]:
#Functions in python

In [35]:
def my_func():
    print("Hello this is my function")

In [37]:
my_func()

Hello this is my function

In [38]:
def body(legs,nose):
    print("I have",legs,"legs")
    print("I have",nose,"nose")

In [39]:
body(2,1)

I have 2 legs
I have 1 nose

In [56]:
import pandas as pd

In [41]:
df = pd.DataFrame({'X':[46,42,85,96,10],'Y':[85,69,32,14,52],'Z':[78,65,10,12,32],'p':['a','b','c','d','e']})

In [42]:
df[['X','Y']]

    X   Y
0  46  85
1  42  69
2  85  32
3  96  14
4  10  52

In [46]:
df['X'].sum()

279

In [47]:
#loc #iloc

In [48]:
df.loc[[0,3],['X','Y']]

    X   Y
0  46  85
3  96  14

In [49]:
s = pd.Series([2,3,4,5,6])

In [50]:
s

0    2
1    3
2    4
3    5
4    6
dtype: int64

In [52]:
df.describe(include='all')

                X          Y          Z    p
count    5.000000   5.000000   5.000000    5
unique        NaN        NaN        NaN    5
top           NaN        NaN        NaN    d
freq          NaN        NaN        NaN    1
mean    55.800000  50.400000  39.400000  NaN
std     34.831021  28.324901  30.883653  NaN
min     10.000000  14.000000  10.000000  NaN
25%     42.000000  32.000000  12.000000  NaN
50%     46.000000  52.000000  32.000000  NaN
75%     85.000000  69.000000  65.000000  NaN
max     96.000000  85.000000  78.000000  NaN

In [63]:
df = pd.read_csv("titles.csv")

In [70]:
pd.read

AttributeError: module 'pandas' has no attribute 'read'

In [65]:
c = df.head(10)

In [66]:
c

                            title  year
0                  The Rising Son  1990
1         The Thousand Plane Raid  1969
2                Crucea de piatra  1993
3                         Country  2000
4                      Gaiking II  2011
5                     Medusa (IV)  2015
6  The Fresh Air Will Do You Good  2008
7              Alex in Wonderland  1970
8                      L'outsider  2016
9          Do Outro Lado do Mundo  2008

In [71]:
c.tail()

                            title  year
5                     Medusa (IV)  2015
6  The Fresh Air Will Do You Good  2008
7              Alex in Wonderland  1970
8                      L'outsider  2016
9          Do Outro Lado do Mundo  2008

In [72]:
df.tail()

                                       title  year
230616                 Nobody Waved Good-bye  1964
230617                                 E yue  2005
230618                          Lakota Girls  2015
230619                        Kroniki domowe  1997
230620  Death in the Valley of Good and Evil  2018

In [73]:
df.year

0         1990
1         1969
2         1993
3         2000
4         2011
          ...
230616    1964
230617    2005
230618    2015
230619    1997
230620    2018
Name: year, Length: 230621, dtype: int64

In [74]:
len(df)

230621

In [75]:
df.shape

(230621, 2)

In [76]:
t = df

In [77]:
t[t.title =="Star Wars"]

            title  year
163388  Star Wars  1977

In [79]:
t[t.title =="Macbeth"].sort_values("year",ascending= False)

          title  year
168225  Macbeth  2017
146810  Macbeth  2016
125469  Macbeth  2015
154409  Macbeth  2014
11539   Macbeth  2013
150447  Macbeth  2009
55416   Macbeth  2006
131922  Macbeth  2004
86470   Macbeth  2003
25430   Macbeth  1998
16930   Macbeth  1997
203220  Macbeth  1987
157917  Macbeth  1948
67313   Macbeth  1916
4162    Macbeth  1913